# Задание 3. Звездный треугольник
# Напишите программу, которая выводит указанный треугольник, состоящий из звездочек (*).
# *
# **
# ***
# ****
# *****
# ******
# *******
counter = 1
while(counter<=8):
    print("*"*counter)
    counter += 1
