# Задание 6. I like Python
# Напишите программу, которая выводит на экран текст «I***like***Python» (без кавычек).
# Примечание. Используйте необязательный параметр sep.
print("I","like","python", sep="***")