# Задание 2. Счастливая последовательность 2
# Измените предыдущую программу так, чтобы каждое число последовательности 4 8 15 16 23 42 печаталось на отдельной строке.
# Примечание. Каждая последующая команда print() выводит указанный текст, начиная с новой строки.

print('4','8','15','16','23','42', sep="\n")