# Задание 1. Футбольная команда
# Напишите программу, которая считывает с клавиатуры название футбольной команды и выводит фразу:
# «Футбольная команда [введённая строка] имеет длину [длина введённой строки] символов».
team = input("Введите название футбольной команды: ")
print(f"Футбольная команда {team} имеет длину {len(team)} символов")
