# Задание 5. Дробная часть
# Дано положительное действительное число. Выведите его дробную часть.
num = float(input("Введите число: "))

fractional_part = num % 1
print(fractional_part)
