# Задание 2. Сумма трёх чисел
#
# Напишите программу, которая считывает три целых числа и выводит на экран их сумму. Каждое число записано в отдельной строке.
# Формат входных данных
# На вход программе подаётся три целых числа, каждое на отдельной строке.
# Формат выходных данных
# Программа должна вывести сумму введенных чисел.
a = int(input("Введите первое число: "))
b = int(input("Введите второе число: "))
c = int(input("Введите третье число: "))
print(f"Ответ: {a + b + c}")
